Autodesk.Navisworks.Api.ProgressMessageReportingEventArgs
Event arguments used for the Application.ProgressMessageReporting event

Autodesk.Navisworks.Api.ProgressMessageReportingEventArgs.Message
Gets a message describing the current operation.
Displayed in Navisworks progress dialog.

Autodesk.Navisworks.Api.ProgressMessageReportingEventArgs.Progress
Gets a reference to the Progress class instance relating to this Event.